// 1. Презентация.  Введение в JavaScript.

// 2. Упражнение 1. Консоль.  

console.log('My name is Roman');



// 3. Упражнение 2. Переменная. 

const name = "Roman"
console.log(name);


// 4. Упражнение. Название переменной.  



/** 5. Упражнение. Сложение.  
 * Выведите в консоль общую стоимость всех книг на складе.
 * В переменной bookPrice хранится цена книги в книжном магазине,
 * а в переменной bookAmount — количество книг на складе.
 * Выведите в консоль общую стоимость всех книг на складе.
*/
let bookPrice = 750;
let bookAmount = 14;
console.log(bookPrice * bookAmount);



// 6. Упражнение. Операции над числом.  

let num = 57;
console.log(num ** 5 % 3);


// 7. Задача. Перевод в систему единиц. 

// 8. Количество дней.  